# Ex - GroupBy

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  
### Step 1. Import the necessary libraries

In [28]:
import pandas as pd 
import numpy as np 
import seaborn as sns

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

In [ ]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'

### Step 3. Assign it to a variable called drinks.

In [29]:
drinks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [30]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [31]:
# drinks.columns.str.split(',',expand=True)
drinks.dropna()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

### Step 4. Which continent drinks more beer on average?

In [32]:
beer = drinks[['country','beer_servings','continent']]
beer.groupby(['continent']).count()

           country  beer_servings
continent
AF              53             53
AS              44             44
EU              45             45
OC              16             16
SA              12             12

### Step 5. For each continent print the statistics for wine consumption.

In [38]:
drinks.wine_servings.describe()

count    193.000000
mean      49.450777
std       79.697598
min        0.000000
25%        1.000000
50%        8.000000
75%       59.000000
max      370.000000
Name: wine_servings, dtype: float64

### Step 6. Print the mean alcohol consumption per continent for every column

In [34]:
alc_cons = drinks[['country','total_litres_of_pure_alcohol','continent']].groupby(['continent']).mean()
alc_cons

           total_litres_of_pure_alcohol
continent
AF                             3.007547
AS                             2.170455
EU                             8.617778
OC                             3.381250
SA                             6.308333

### Step 7. Print the median alcohol consumption per continent for every column

In [35]:
alc_cons.groupby(['continent']).median()

           total_litres_of_pure_alcohol
continent
AF                             3.007547
AS                             2.170455
EU                             8.617778
OC                             3.381250
SA                             6.308333

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [36]:
spirit = drinks[['spirit_servings','continent']].groupby(['continent']).describe()
spirit

          spirit_servings                                                     \
                    count        mean        std   min    25%    50%     75%
continent
AF                   53.0   16.339623  28.102794   0.0   1.00    3.0   19.00
AS                   44.0   60.840909  84.362160   0.0   1.00   16.0   98.00
EU                   45.0  132.555556  77.589115   0.0  81.00  122.0  173.00
OC                   16.0   58.437500  70.504817   0.0  18.00   37.0   65.25
SA                   12.0  114.750000  77.077440  25.0  65.75  108.5  148.75


             max
continent
AF         152.0
AS         326.0
EU         373.0
OC         254.0
SA         302.0